api-platform-load-testing/jmeter.log
2017/02/08 18:05:15 INFO  - jmeter.util.JMeterUtils: Setting Locale to en_US 
2017/02/08 18:05:15 INFO  - jmeter.engine.StandardJMeterEngine: Running the test! 
2017/02/08 18:05:15 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/02/08 18:05:15 INFO  - jmeter.engine.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group 
2017/02/08 18:05:15 INFO  - jmeter.engine.StandardJMeterEngine: Starting 10 threads for group Thread Group. 
2017/02/08 18:05:15 INFO  - jmeter.engine.StandardJMeterEngine: Thread will continue on error 
2017/02/08 18:05:15 INFO  - jmeter.threads.ThreadGroup: Starting thread group number 1 threads 10 ramp-up 1 perThread 100.0 delayedStart=false 
2017/02/08 18:05:15 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-1 
2017/02/08 18:05:15 INFO  - jmeter.threads.ThreadGroup: Started thread group number 1 
2017/02/08 18:05:15 INFO  - jmeter.engine.StandardJMeterEngine: All thread groups have been started 
2017/02/08 18:05:15 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-2 
2017/02/08 18:05:15 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-3 
2017/02/08 18:05:15 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-4 
2017/02/08 18:05:15 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-5 
2017/02/08 18:05:15 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-6 
2017/02/08 18:05:16 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-7 
2017/02/08 18:05:16 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-8 
2017/02/08 18:05:16 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-9 
2017/02/08 18:05:16 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-10 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-3 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-3 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-4 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-4 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-6 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-6 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-2 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-2 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-8 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-8 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-9 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-9 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-7 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-7 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-1 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-1 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-5 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-5 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: Thread Group 1-10 
2017/02/08 18:05:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-10 
2017/02/08 18:05:25 INFO  - jmeter.engine.StandardJMeterEngine: Notifying test listeners of end of test 
2017/02/08 18:05:25 INFO  - jmeter.reporters.Summariser: summary =    524 in 00:00:10 =   50.2/s Avg:   183 Min:   154 Max:   400 Err:   524 (100.00%)